[Killed] BlockStatement
src/domain/createSession.js:1:43
-async function createSession(sessionData) {
-  return sessionData;
-}
+async function createSession(sessionData) {}
 
 module.exports = {
killedBy: Create Session Domain Function returns the same session payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "s-1"}
Received: undefined
