[Killed] BlockStatement
src/adapters/httpAdapter.js:4:45
 const { createSession } = require("../domain/createSession");
 const { notifySessionCreated } = require("./analytics/httpAnalyticsNotifier");
 
-async function scheduleSession(sessionData) {
-  const session = await createSession(sessionData);
-  await notifySessionCreated(session);
-  return session;
-}
+async function scheduleSession(sessionData) {}
 
 module.exports = {
killedBy: HTTP Adapter behavior schedules by creating and notifying
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "s-1"}

Number of calls: 0
