[Killed] BlockStatement
src/adapters/persistence/inMemorySessionRepository.js:1:23
-async function ping() {
-  return "pong";
-}
+async function ping() {}
 
 module.exports = {
killedBy: Walking Skeleton - Persistence Capability Application connects to persistence layer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pong"
Received: undefined

[Killed] ObjectLiteral
src/adapters/persistence/inMemorySessionRepository.js:5:18
   return "pong";
 }
 
-module.exports = {
-  ping,
-};
+module.exports = {};
 
killedBy: Walking Skeleton - Persistence Capability Application connects to persistence layer
statusReason: TypeError: repository.ping is not a function
