[Killed] BlockStatement
src/adapters/analytics/httpAnalyticsNotifier.js:3:50
 const axios = require("axios");
 
-async function notifySessionCreated(sessionData) {
-  await axios.post("https://example.com/analytics", sessionData);
-}
+async function notifySessionCreated(sessionData) {}
 
 module.exports = {
killedBy: HTTP Analytics Notifier posts analytics payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://example.com/analytics", {"id": "s-1"}

Number of calls: 0

[Killed] ObjectLiteral
src/adapters/analytics/httpAnalyticsNotifier.js:7:18
   await axios.post("https://example.com/analytics", sessionData);
 }
 
-module.exports = {
-  notifySessionCreated,
-};
+module.exports = {};
 
killedBy: HTTP Analytics Notifier exports notifySessionCreated
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "notifySessionCreated"
Received path: []

Received value: {}
