[Timeout] BlockStatement
src/app.js:7:34
 
 app.use(express.json());
 
-app.post("/input", (req, res) => {
-  res.status(200).json({ received: req.body });
-});
+app.post("/input", (req, res) => {});
 
 app.post("/sessions", (_req, res) => {

[Killed] ObjectLiteral
src/app.js:8:24
 app.use(express.json());
 
 app.post("/input", (req, res) => {
-  res.status(200).json({ received: req.body });
+  res.status(200).json({});
 });
 
killedBy: Walking Skeleton - Input Capability System accepts external JSON input
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "received": Object {
-     "message": "Hello Skeleton",

[Timeout] BlockStatement
src/app.js:11:38
   res.status(200).json({ received: req.body });
 });
 
-app.post("/sessions", (_req, res) => {
-  res.sendStatus(201);
-});
+app.post("/sessions", (_req, res) => {});
 
 app.get("/health", (_req, res) => {

[Timeout] BlockStatement
src/app.js:15:35
   res.sendStatus(201);
 });
 
-app.get("/health", (_req, res) => {
-  res.sendStatus(200);
-});
+app.get("/health", (_req, res) => {});
 
 module.exports = app;

[Killed] StringLiteral
src/app.js:15:9
   res.sendStatus(201);
 });
 
-app.get("/health", (_req, res) => {
+app.get("", (_req, res) => {
   res.sendStatus(200);
 });
killedBy: GET /health returns OK
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404
