[Killed] BooleanLiteral
src/domain/session.js:4:27
 let currentSession = null;
 let sessionCount = 0;
 let inactiveSessionCount = 0;
-let overlappingSessions = false;
+let overlappingSessions = true;
 let sessions = [];
 let rejectOnOverlap = false;
killedBy: Session Domain mutation hardening starts with no overlap detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/domain/session.js:6:23
 let inactiveSessionCount = 0;
 let overlappingSessions = false;
 let sessions = [];
-let rejectOnOverlap = false;
+let rejectOnOverlap = true;
 
 function startSession(timeRange = {}) {
killedBy: Session Domain – INTERFACE (Intent to notify) returns notification intent when overlap occurs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
+   "error": "SESSION_OVERLAP_NOT_ALLOWED",

[Killed] BooleanLiteral
src/domain/session.js:10:13
 
 function startSession(timeRange = {}) {
   const nextSession = {
-    active: true,
+    active: false,
     start: timeRange.start,
     end: timeRange.end,
killedBy: Session Domain mutation hardening ending same session twice only updates counters once
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] LogicalOperator
src/domain/session.js:16:5
   };
 
   if (
-    currentSession &&
-    currentSession.start < nextSession.end &&
+    currentSession || currentSession.start < nextSession.end &&
     currentSession.end > nextSession.start
   ) {
killedBy: Session Domain mutation hardening boundary-touching sessions do not overlap
statusReason: TypeError: Cannot read properties of null (reading 'start')

[Killed] ConditionalExpression
src/domain/session.js:16:5
   };
 
   if (
-    currentSession &&
-    currentSession.start < nextSession.end &&
-    currentSession.end > nextSession.start
+    false
   ) {
     overlappingSessions = true;
killedBy: Session Domain mutation hardening notify mode adds overlapping session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
+   "notification": null,

[Killed] EqualityOperator
src/domain/session.js:17:5
 
   if (
     currentSession &&
-    currentSession.start < nextSession.end &&
+    currentSession.start >= nextSession.end &&
     currentSession.end > nextSession.start
   ) {
killedBy: Session Domain mutation hardening sessions ending at current start do not overlap
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": null,
+   "notification": "SESSION_OVERLAP_DETECTED",

[Killed] ConditionalExpression
src/domain/session.js:17:5
 
   if (
     currentSession &&
-    currentSession.start < nextSession.end &&
+    true &&
     currentSession.end > nextSession.start
   ) {
killedBy: Session Domain mutation hardening sessions ending at current start do not overlap
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": null,
+   "notification": "SESSION_OVERLAP_DETECTED",

[Killed] EqualityOperator
src/domain/session.js:18:5
   if (
     currentSession &&
     currentSession.start < nextSession.end &&
-    currentSession.end > nextSession.start
+    currentSession.end >= nextSession.start
   ) {
     overlappingSessions = true;
killedBy: Session Domain mutation hardening boundary-touching sessions do not overlap
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": null,
+   "notification": "SESSION_OVERLAP_DETECTED",

[Killed] ConditionalExpression
src/domain/session.js:18:5
   if (
     currentSession &&
     currentSession.start < nextSession.end &&
-    currentSession.end > nextSession.start
+    true
   ) {
     overlappingSessions = true;
killedBy: Session Domain mutation hardening boundary-touching sessions do not overlap
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": null,
+   "notification": "SESSION_OVERLAP_DETECTED",

[Killed] BlockStatement
src/domain/session.js:19:5
     currentSession &&
     currentSession.start < nextSession.end &&
     currentSession.end > nextSession.start
-  ) {
-    overlappingSessions = true;
-
-    if (rejectOnOverlap) {
-      return {
-        error: "SESSION_OVERLAP_NOT_ALLOWED",
-      };
-    }
-
-    {
-      currentSession = nextSession;
-      sessions.push(nextSession);
-      sessionCount += 1;
-
-      return {
-        notification: "SESSION_OVERLAP_DETECTED",
-      };
-    }
-  }
+  ) {}
 
   currentSession = nextSession;
killedBy: Session Domain mutation hardening notify mode adds overlapping session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
+   "notification": null,

[Killed] BooleanLiteral
src/domain/session.js:20:27
     currentSession.start < nextSession.end &&
     currentSession.end > nextSession.start
   ) {
-    overlappingSessions = true;
+    overlappingSessions = false;
 
     if (rejectOnOverlap) {
killedBy: Session Domain – BOUNDARY (Overlap) detects overlapping sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/domain/session.js:22:9
   ) {
     overlappingSessions = true;
 
-    if (rejectOnOverlap) {
+    if (true) {
       return {
         error: "SESSION_OVERLAP_NOT_ALLOWED",
killedBy: Session Domain mutation hardening notify mode adds overlapping session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
+   "error": "SESSION_OVERLAP_NOT_ALLOWED",

[Killed] ConditionalExpression
src/domain/session.js:22:9
   ) {
     overlappingSessions = true;
 
-    if (rejectOnOverlap) {
+    if (false) {
       return {
         error: "SESSION_OVERLAP_NOT_ALLOWED",
killedBy: Session Domain – EXCEPTION rejects overlapping session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "SESSION_OVERLAP_NOT_ALLOWED",
+   "notification": "SESSION_OVERLAP_DETECTED",

[Killed] BlockStatement
src/domain/session.js:28:5
       };
     }
 
-    {
-      currentSession = nextSession;
-      sessions.push(nextSession);
-      sessionCount += 1;
-
-      return {
-        notification: "SESSION_OVERLAP_DETECTED",
-      };
-    }
+    {}
   }
 
killedBy: Session Domain mutation hardening notify mode adds overlapping session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
+   "notification": null,

[Killed] AssignmentOperator
src/domain/session.js:31:7
     {
       currentSession = nextSession;
       sessions.push(nextSession);
-      sessionCount += 1;
+      sessionCount -= 1;
 
       return {
killedBy: Session Domain mutation hardening notify mode adds overlapping session
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ObjectLiteral
src/domain/session.js:33:14
       sessions.push(nextSession);
       sessionCount += 1;
 
-      return {
-        notification: "SESSION_OVERLAP_DETECTED",
-      };
+      return {};
     }
   }
killedBy: Session Domain – INTERFACE (Intent to notify) returns notification intent when overlap occurs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
- }

[Killed] StringLiteral
src/domain/session.js:34:23
       sessionCount += 1;
 
       return {
-        notification: "SESSION_OVERLAP_DETECTED",
+        notification: "",
       };
     }
killedBy: Session Domain – INTERFACE (Intent to notify) returns notification intent when overlap occurs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "notification": "SESSION_OVERLAP_DETECTED",
+   "notification": "",

[Killed] BlockStatement
src/domain/session.js:43:24
   sessions.push(nextSession);
   sessionCount += 1;
 
-  if (rejectOnOverlap) {
-    return {
-      error: null,
-    };
-  }
+  if (rejectOnOverlap) {}
 
   return {
killedBy: Session Domain mutation hardening getSessions is enumerable and switches to reject contract
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": null,
+   "notification": null,

[Killed] BlockStatement
src/domain/session.js:54:30
   };
 }
 
-function getCurrentSession() {
-  return currentSession;
-}
+function getCurrentSession() {}
 
 function hasMultipleSessions() {
killedBy: Session Domain – ZERO returns null when no sessions exist
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/domain/session.js:58:32
   return currentSession;
 }
 
-function hasMultipleSessions() {
-  return sessionCount > 1;
-}
+function hasMultipleSessions() {}
 
 function countActiveSessions() {
killedBy: Session Domain mutation hardening returns false for multiple sessions when only one exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/domain/session.js:59:10
 }
 
 function hasMultipleSessions() {
-  return sessionCount > 1;
+  return true;
 }
 
killedBy: Session Domain mutation hardening returns false for multiple sessions when only one exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/domain/session.js:59:10
 }
 
 function hasMultipleSessions() {
-  return sessionCount > 1;
+  return sessionCount <= 1;
 }
 
killedBy: Session Domain mutation hardening returns false for multiple sessions when only one exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/domain/session.js:62:32
   return sessionCount > 1;
 }
 
-function countActiveSessions() {
-  return sessionCount;
-}
+function countActiveSessions() {}
 
 function endSession() {
killedBy: Session Domain mutation hardening notify mode adds overlapping session
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/domain/session.js:66:23
   return sessionCount;
 }
 
-function endSession() {
-  if (currentSession && currentSession.active) {
-    currentSession.active = false;
-    sessionCount -= 1;
-    inactiveSessionCount += 1;
-  }
-}
+function endSession() {}
 
 function countInactiveSessions() {
killedBy: Session Domain mutation hardening ending same session twice only updates counters once
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/domain/session.js:67:7
 }
 
 function endSession() {
-  if (currentSession && currentSession.active) {
+  if (false) {
     currentSession.active = false;
     sessionCount -= 1;
killedBy: Session Domain mutation hardening ending same session twice only updates counters once
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/domain/session.js:67:7
 }
 
 function endSession() {
-  if (currentSession && currentSession.active) {
+  if (true) {
     currentSession.active = false;
     sessionCount -= 1;
killedBy: Session Domain mutation hardening ending without a current session is a no-op
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot set properties of null (setting 'active')"

      145 |       } else {
      146 |         stryCov_9fa48("62");
    > 147 |         currentSession.active = stryMutAct_9fa48("63") ? true : (stryCov_9fa48("63"), false);

[Killed] BooleanLiteral
src/domain/session.js:68:29
 
 function endSession() {
   if (currentSession && currentSession.active) {
-    currentSession.active = false;
+    currentSession.active = true;
     sessionCount -= 1;
     inactiveSessionCount += 1;
killedBy: Session Domain mutation hardening ending same session twice only updates counters once
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] AssignmentOperator
src/domain/session.js:69:5
 function endSession() {
   if (currentSession && currentSession.active) {
     currentSession.active = false;
-    sessionCount -= 1;
+    sessionCount += 1;
     inactiveSessionCount += 1;
   }
killedBy: Session Domain mutation hardening ending same session twice only updates counters once
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] AssignmentOperator
src/domain/session.js:70:5
   if (currentSession && currentSession.active) {
     currentSession.active = false;
     sessionCount -= 1;
-    inactiveSessionCount += 1;
+    inactiveSessionCount -= 1;
   }
 }
killedBy: Session Domain – MANY counts inactive sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/domain/session.js:74:34
   }
 }
 
-function countInactiveSessions() {
-  return inactiveSessionCount;
-}
+function countInactiveSessions() {}
 
 function hasOverlappingSessions() {
killedBy: Session Domain mutation hardening ending without a current session is a no-op
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/domain/session.js:78:35
   return inactiveSessionCount;
 }
 
-function hasOverlappingSessions() {
-  return overlappingSessions;
-}
+function hasOverlappingSessions() {}
 
 function getSessions() {
killedBy: Session Domain mutation hardening starts with no overlap detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/domain/session.js:82:24
   return overlappingSessions;
 }
 
-function getSessions() {
-  return sessions;
-}
+function getSessions() {}
 
 class Session {
killedBy: Session Domain – EXCEPTION rejects overlapping session
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/domain/session.js:87:31
 }
 
 class Session {
-  constructor({ id, status }) {
-    this.id = id;
-    this.status = status;
-  }
+  constructor({ id, status }) {}
 
   complete() {
killedBy: Session completion policy (S - Simple scenario) can complete a confirmed session
statusReason: Error: Only confirmed sessions can be completed

[Killed] BlockStatement
src/domain/session.js:92:14
     this.status = status;
   }
 
-  complete() {
-    if (this.status !== "confirmed") {
-      throw new Error("Only confirmed sessions can be completed");
-    }
-
-    this.status = "completed";
-  }
+  complete() {}
 }
 
killedBy: Session completion policy (S - Simple scenario) cannot complete an unconfirmed session
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only confirmed sessions can be completed"

Received function did not throw

[Killed] ConditionalExpression
src/domain/session.js:93:9
   }
 
   complete() {
-    if (this.status !== "confirmed") {
+    if (false) {
       throw new Error("Only confirmed sessions can be completed");
     }
killedBy: Session completion policy (S - Simple scenario) cannot complete an unconfirmed session
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only confirmed sessions can be completed"

Received function did not throw

[Killed] ConditionalExpression
src/domain/session.js:93:9
   }
 
   complete() {
-    if (this.status !== "confirmed") {
+    if (true) {
       throw new Error("Only confirmed sessions can be completed");
     }
killedBy: Session completion policy (S - Simple scenario) can complete a confirmed session
statusReason: Error: Only confirmed sessions can be completed

[Killed] StringLiteral
src/domain/session.js:97:19
       throw new Error("Only confirmed sessions can be completed");
     }
 
-    this.status = "completed";
+    this.status = "";
   }
 }
killedBy: Session completion policy (S - Simple scenario) can complete a confirmed session
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "completed"
Received: ""

[Killed] ObjectLiteral
src/domain/session.js:101:20
   }
 }
 
-const sessionApi = {
-  Session,
-  startSession,
-  endSession,
-  getCurrentSession,
-  hasMultipleSessions,
-  countActiveSessions,
-  countInactiveSessions,
-  hasOverlappingSessions,
-};
+const sessionApi = {};
 
 Object.defineProperty(sessionApi, "getSessions", {
killedBy: Session Domain mutation hardening starts with no overlap detected
statusReason: TypeError: hasOverlappingSessions is not a function

[Killed] StringLiteral
src/domain/session.js:112:35
   hasOverlappingSessions,
 };
 
-Object.defineProperty(sessionApi, "getSessions", {
+Object.defineProperty(sessionApi, "", {
   enumerable: true,
   get() {
killedBy: Session Domain – EXCEPTION rejects overlapping session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "SESSION_OVERLAP_NOT_ALLOWED",
+   "notification": "SESSION_OVERLAP_DETECTED",

[Killed] BooleanLiteral
src/domain/session.js:113:15
 };
 
 Object.defineProperty(sessionApi, "getSessions", {
-  enumerable: true,
+  enumerable: false,
   get() {
     rejectOnOverlap = true;
killedBy: Session Domain mutation hardening getSessions is enumerable and switches to reject contract
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "getSessions"
Received array: ["Session", "startSession", "endSession", "getCurrentSession", "hasMultipleSessions", "countActiveSessions", "countInactiveSessions", "hasOverlappingSessions"]

[Killed] BlockStatement
src/domain/session.js:114:9
 
 Object.defineProperty(sessionApi, "getSessions", {
   enumerable: true,
-  get() {
-    rejectOnOverlap = true;
-    return getSessions;
-  },
+  get() {},
 });
 
killedBy: Session Domain mutation hardening getSessions is enumerable and switches to reject contract
statusReason: TypeError: getSessions is not a function

[Killed] BooleanLiteral
src/domain/session.js:115:23
 Object.defineProperty(sessionApi, "getSessions", {
   enumerable: true,
   get() {
-    rejectOnOverlap = true;
+    rejectOnOverlap = false;
     return getSessions;
   },
killedBy: Session Domain mutation hardening getSessions is enumerable and switches to reject contract
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": null,
+   "notification": null,
