[Killed] ObjectLiteral
src/ports/index.js:3:18
 function scheduleSession() {}
 
-module.exports = {
-  scheduleSession,
-};
+module.exports = {};
 
killedBy: Ports Scheduling port exists
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "scheduleSession"
Received path: []

Received value: {}
